<!-- # -*- mode: markdown; coding: utf-8; fill-column: 60; org-indent-mode: t; column-number-mode: t; flyspell-mode: t; ispell-local-dictionary: "en"; eval: (visual-on); -*- -->

<meta charset="utf-8"/>
<meta name="viewport" content="width=device-width,initial-scale=1"/>
<link rel="stylesheet" href="style.css">


# EDAF75 - lab 1: SQL

This lab is meant to be run as a `jupyter` notebook, you could download it [here](lab1.zip) (the zip-file contains the notebook and the database, and a [.html-file](lab1.html) which you can read in case you have problems reading/running jupyter notebooks).

To start your notebook, you can use the following commands (after you've downloaded [the zip file](lab1.zip) -- observe that the `$` is the shell prompt, you shouldn't type it):

```sh
$ unzip lab1.zip
$ jupyter notebook    # or jupyter lab
```

This should start jupyter in a browser tab, and there you can click "lab1.ipynb".


# Background

We have a database to handle the academic achievements of students at LTH -- in it we have four tables:

<hr>
<table rules="all">
 <tr>
  <th align="left"><code>students:</code></th>
  <th></th>
 </tr>
 <tr>
  <td><code>ssn</code></td>
  <td>social security number</td>
 </tr>
 <tr>
  <td><code>first_name</code></td>
  <td>first name (obviously!)</td>
 </tr>
 <tr>
  <td><code>last_name</code></td>
  <td>last name</td>
 </tr>
</table>

<hr>
<table rules="all">
 <tr>
  <th align="left"><code>departments:</code></th>
  <th></th>
 </tr>
 <tr>
  <td><code>department_code</code></td>
  <td>unique code for each department</td>
 </tr>
 <tr>
  <td><code>department_name</code></td>
  <td>the name of the department, in Swedish</td>
 </tr>
</table>

<hr>
<table rules="all">
 <tr>
  <th align="left"><code>courses:</code></th>
  <th></th>
 </tr>
 <tr>
  <td><code>course_code</code></td>
  <td>course code, like <code>EDAF75</code></td>
 </tr>
 <tr>
  <td><code>course_name</code></td>
  <td>the name of the course, in Swedish (like "Databasteknik")</td>
 </tr>
 <tr>
  <td><code>department_code</code></td>
  <td>the department giving the course</td>
 </tr>
 <tr>
  <td><code>level</code></td>
  <td>the course level, like "G1", "G2", or "A"</td>
 </tr>
 <tr>
  <td><code>credits</code></td>
  <td>the number of credits for the course, like 7.5</td>
 </tr>
</table>

<hr>
<table rules="all">
 <tr>
  <th align="left"><code>finished_courses:</code></th>
  <th></th>
 </tr>
 <tr>
  <td><code>ssn</code></td>
  <td>the social security number of a student</td>
 </tr>
 <tr>
  <td><code>course_code</code></td>
  <td>the course code for the course the student has taken</td>
 </tr>
 <tr>
  <td><code>grade</code></td>
  <td>the grade for the student passing the course</td>
 </tr>
</table>

<hr>

<center>
  <img src="lab1-er.svg">
</center>

Some sample data:

```text
ssn           first_name   last_name
---           ----------   ---------
861103–2438   Bo           Ek
911212–1746   Eva          Alm
950829–1848   Anna         Nyström
...           ...          ...

department_code  department_name
---------------  ----------------------------------------
eda              Datavetenskap
edi              Informationsteori
eem              Elektrisk mätteknik
eie              Industriell elektroteknik och automation
...              ...

course_code  course_name                         department_code  level  credits
-----------  ----------------------------------  ---------------  -----  -------
ETTN05       Adaptiv signalbehandling            eit              A      7.5
FMAN10       Algebraiska strukturer              fma              A      7.5
ETIN80       Algoritmer i signalprocessorer...   eit              A      7.5
EDAF05       Algoritmer, datastrukturer och...   eda              G2     5.0
...          ...                                 ...              ...    ...

ssn           course_code   grade
---           -----------   -----
861103–2438   EDA016        4
861103–2438   EDAA01        3
911212–1746   EDA016        3
...           ...           ...
```

The tables have been created with the following SQL
statements:

```sql
CREATE TABLE students (
  ssn          CHAR(11),
  first_name   TEXT NOT NULL,
  last_name    TEXT NOT NULL,
  PRIMARY KEY  (ssn)
);

CREATE TABLE departments (
  department_code    TEXT,
  department_name    TEXT,
  PRIMARY KEY (department_code)
);

CREATE TABLE courses (
  course_code      CHAR(6),
  course_name      TEXT NOT NULL,
  department_code  TEXT,
  level            CHAR(2),
  credits          DOUBLE NOT NULL CHECK (credits >= 0),
  PRIMARY KEY      (course_code),
  FOREIGN KEY      (department_code) REFERENCES departments(department_code)
);

CREATE TABLE finished_courses (
  ssn           CHAR(11),
  course_code   CHAR(6),
  grade         INTEGER NOT NULL CHECK (grade >= 3 AND grade <= 5),
  PRIMARY KEY   (ssn, course_code),
  FOREIGN KEY   (ssn) REFERENCES students(ssn),
  FOREIGN KEY   (course_code) REFERENCES courses(course_code)
);
```

All courses offered at the "Computer Science and Engineering" program at LTH during the academic year 2013/14 are in the table 'courses`. Also, the database has been filled with made up data. SQL statements like the following have been used to insert the data:

```sql
INTO   students(ssn, first_name, last_name)
VALUES ('950705-2308', 'Anna', 'Johansson'),
       ('930702-3582', 'Anna', 'Johansson'),
       ('911212-1746', 'Eva', 'Alm'),
       ('910707-3787', 'Eva', 'Nilsson'),
       ...
```

The information about which departments gives which courses is somewhat haphazard (some of the departments in the database no longer exist, and some of them may never have existed).
Our database assumes each course is given by a single department, in real life, departments can share courses -- if you want to practice what we're talking about in week 2 and week 3, try to come up with a modification of the database design, which allows departments to share courses (you can ask your TA about it during the lab session).


# Assignments

To pass this lab, you only need to show your solutions to the problems marked REVIEW below -- that's the only ones we'll be looking at during the lab sessions.
You can skip the other problems at your own discretion, but I strongly recommend that you try them out, for practice.

As said above, this lab is designed to be run as a jupyter notebook (either using =jupyter lab=, or =jupyter notebook=).
If you haven't been able to get =jupyter= up and running on your computer, you can run the sql-commands for the problems below interactively inside =sqlite3=, or as a script file with all your commands, or inside some IDE, like [DB Browser for SQLite](https://sqlitebrowser.org/).

If you're running the lab as a notebook (and hopefully you are!), evaluate the following cells before you begin:

In [1]:
%load_ext sql

Loading configurations from /home/hugo/Documents/skola/edaf75/repo/pyproject.toml.

Settings changed:

+------------+-------+
|   Config   | value |
+------------+-------+
|  feedback  |  True |
| autopandas |  True |
+------------+-------+

In [2]:
%sql sqlite:///lab1.sqlite

Connecting to 'sqlite:///lab1.sqlite'

--------------------------------
Jump to [REVIEW problems](#review_problems)
--------------------------------

The tables `students`, `departments`, `courses` and `finished_courses` are already in your database, you can see some of their contents by running the cells below:

In [3]:
%%sql
SELECT  *
FROM    students
LIMIT   4

Running query in 'sqlite:///lab1.sqlite'

           ssn first_name  last_name
0  950705-2308       Anna  Johansson
1  930702-3582       Anna  Johansson
2  911212-1746        Eva        Alm
3  910707-3787        Eva    Nilsson

In [4]:
%%sql
SELECT  *
FROM    departments
LIMIT   4

Running query in 'sqlite:///lab1.sqlite'

  department_code                           department_name
0             eda                             Datavetenskap
1             edi                         Informationsteori
2             eem                       Elektrisk mätteknik
3             eie  Industriell elektroteknik och automation

In [5]:
%%sql
SELECT  *
FROM    courses
LIMIT   4

Running query in 'sqlite:///lab1.sqlite'

  course_code            course_name department_code level  credits
0      EDA016   Programmeringsteknik             eda    G1      7.5
1      EDA031    C++ - programmering             eda    G2      7.5
2      EDA040  Realtidsprogrammering             eda    G2      6.0
3      EDA050         Operativsystem             eda    G2      4.5

In [6]:
%%sql
SELECT  *
FROM    finished_courses
LIMIT   4

Running query in 'sqlite:///lab1.sqlite'

           ssn course_code  grade
0  950705-2308      EITN35      5
1  950705-2308      ESS050      3
2  950705-2308      ETIN70      4
3  950705-2308      FMA140      4

If you inadvertently change the contents of the tables, you can always recreate the them with the following command (it must be run at the command line):

```sh
$ sqlite3 lab1.sqlite < lab1-setup.sql
```

## Practice problems

<a id='problem_1'></a>

### Problem 1 (practice)

What are the names (first name and last name) of all the students?

In [7]:
%%sql
select   first_name, last_name
from     students

Running query in 'sqlite:///lab1.sqlite'

   first_name   last_name
0        Anna   Johansson
1        Anna   Johansson
2         Eva         Alm
3         Eva     Nilsson
4      Elaine   Robertson
..        ...         ...
67     Daniel    Axelsson
68   Per-Erik  Pettersson
69      Roger    Brorsson
70     Patrik     Ohlsson
71      Peter     Solberg

[72 rows x 2 columns]

Now sort the names, first by last name and then by first name:

In [8]:
%%sql
select   last_name, first_name
from     students
order by last_name, first_name

Running query in 'sqlite:///lab1.sqlite'

    last_name first_name
0      Ahlman     Daniel
1         Alm        Eva
2         Alm     Martin
3   Andersson       Erik
4   Andersson       Erik
..        ...        ...
67    Troberg     Helena
68    Wallman  Christian
69     Weidel      Frida
70   Wikström       Mats
71    Östberg      Karin

[72 rows x 2 columns]

When you get it to work, experiment by listing only the 10 first students (alphabetically), then try to list only students 11-20, etc.:

In [9]:
%%sql
select   last_name, first_name
from     students
order by last_name, first_name
limit 10
offset 10

Running query in 'sqlite:///lab1.sqlite'

   last_name first_name
0       Berg       Lisa
1    Bergman      Lotta
2  Brattberg      Johan
3   Brorsson      Roger
4   Carlsson      David
5       Dahl    Susanne
6         Ek         Bo
7         Ek         Bo
8         Ek         Bo
9         Ek    Karolin

<a id='problem_2'></a>

### Problem 2 (practice)

What are the names of the students who were born in 1985?

In [10]:
%%sql
select   first_name, last_name, ssn
from     students
where    ssn like '85%'
order by first_name

Running query in 'sqlite:///lab1.sqlite'

  first_name last_name          ssn
0         Bo        Ek  850819-2139
1      Filip   Persson  850517-2597
2     Henrik      Berg  850208-1213
3     Ulrika   Jonsson  850706-2762

Hint: the `substr` function can be useful (it also goes by the name `substring`).


<a id='problem_3'></a>

### Problem 3 (practice)

The penultimate digit in the social security number is even for females, and odd for males.
List the first names of all female students in our database alphabetically.

In [11]:
%%sql
select   first_name
from     students
where    substr(ssn, -2, 1) % 2 = 0
order by first_name

Running query in 'sqlite:///lab1.sqlite'

   first_name
0        Anna
1        Anna
2        Anna
3      Birgit
4    Caroline
5      Elaine
6         Eva
7         Eva
8         Eva
9       Frida
10     Helena
11      Jenny
12      Karin
13    Karolin
14       Lisa
15      Lotta
16      Lotta
17      Maria
18      Maria
19      Marie
20      Märit
21      Sofia
22    Susanne
23       Tina
24     Ulrika
25       Ylva

Now try to output each name only once (so, no duplicates).

In [12]:
%%sql
select distinct  first_name
from     students
where    substr(ssn, -2, 1) % 2 = 0
order by first_name

Running query in 'sqlite:///lab1.sqlite'

   first_name
0        Anna
1      Birgit
2    Caroline
3      Elaine
4         Eva
5       Frida
6      Helena
7       Jenny
8       Karin
9     Karolin
10       Lisa
11      Lotta
12      Maria
13      Marie
14      Märit
15      Sofia
16    Susanne
17       Tina
18     Ulrika
19       Ylva

<a id='problem_4'></a>

### Problem 4 (practice)

How many students are registered in the database?

In [13]:
%%sql
select count()
from students

Running query in 'sqlite:///lab1.sqlite'

   count()
0       72

How many male students are there?

In [14]:
%%sql
select   count()
from     students
where    substr(ssn, -2, 1) % 2 = 1

Running query in 'sqlite:///lab1.sqlite'

   count()
0       46

Now try to output the number of distinct names in the listing of female students above, using `count`.
It turns out that this is a bit tricky, we need to make sure we use the word `DISTINCT` in the right place (look carefully in the [documentation](https://sqlite.org/lang_aggfunc.html)).

In [15]:
%%sql
select   count(distinct first_name) as 'distinct female names count'
from     students
where    substr(ssn, -2, 1) % 2 = 0
order by first_name

Running query in 'sqlite:///lab1.sqlite'

   distinct female names count
0                           20

<a id='problem_6'></a>

### Problem 5 (practice)

In the next few queries, we'll look at the results of the student with the social security number 910101-1234 -- to make things _a lot_ easier, start by creating a `VIEW` with all his results.

In [16]:
%%sql
DROP VIEW IF EXISTS peter;
CREATE VIEW peter AS
select   *
from     students
         join finished_courses using(ssn)
         join courses using(course_code)
where    ssn = '910101-1234'

Running query in 'sqlite:///lab1.sqlite'

Empty DataFrame
Columns: []
Index: []

Make sure the view contains all data pertinent to the student in question (it will make the following queries very simple).

Which courses (course codes only) have been taken by the student?

In [17]:
%%sql
select    course_code
from      peter

Running query in 'sqlite:///lab1.sqlite'

   course_code
0       EDA070
1       EDA385
2       EDAA25
3       EDAF05
4       EEMN10
5       EIT020
6       EIT060
7       EITF40
8       EITN40
9       EITN50
10      ESS050
11      ETIF10
12      ETIF15
13      ETIN35
14      ETS052
15      ETS075
16      ETS200
17      ETSA01
18      EXTA10
19      EXTA35
20      FAFF20
21      FAFF25
22      FMA145
23      FMA420
24      FMAA01
25      FMAF05
26      FMS012
27      FMSF15
28      FMSN30
29      FMSN35
30      FRTN10
31      GEMA45
32      GEMA70
33      MAMF15
34      TEK210

What are the names of these courses, and how many credits do they give?

In [18]:
%%sql
select   course_name, credits
from     peter

Running query in 'sqlite:///lab1.sqlite'

                                          course_name  credits
0                         Datorer och datoranvändning      3.0
1   Konstruktion av inbyggda system, fördjupningskurs      7.5
2                                     C-programmering      3.0
3          Algoritmer, datastrukturer och komplexitet      5.0
4                             Datorbaserade mätsystem      7.5
5                                       Digitalteknik      9.0
6                                        Datasäkerhet      7.5
7                        Digitala och analoga projekt      7.5
8                              Avancerad webbsäkerhet      4.0
9                              Avancerad datasäkerhet      7.5
10                         Elektromagnetisk fältteori      9.0
11       Signalbehandling - design och implementering      7.5
12                         Medicinsk signalbehandling      7.5
13                                       IC-projekt 1      7.5
14                                 Datorkommunikation      4.5
15                                           Kösystem      4.5
16                                Programvarutestning      7.5
17  Ingenjörsprocessen för programvaruutveckling -...      5.0
18  Introduktion till Kinas samhällsliv, kultur oc...      3.0
19  Introduktionskurs i kinesiska för civilingenjörer     15.0
20                           Multispektral avbildning      7.5
21                                              Fysik     11.0
22              Olinjära dynamiska system, projektdel      3.0
23                                     Linjär algebra      6.0
24                              Endimensionell analys     15.0
25                 Matematik - System och transformer      7.0
26                  Matematisk statistik, allmän kurs      9.0
27                                    Markovprocesser      7.5
28                    Linjär och logistisk regression      7.5
29        Stationär och icke-stationär spektralanalys      7.5
30                             Flervariabel reglering      7.5
31                             Förståelse och lärande      3.0
32                              Japanska för tekniker     15.0
33                   Arbetsorganisation och ledarskap      6.0
34                                          Kognition      4.5

How many credits has the student taken?

In [19]:
%%sql
select   sum(credits) as "total credits"
from     peter

Running query in 'sqlite:///lab1.sqlite'

   total credits
0          249.5

What is the student’s grade average?
It turns out that there are actually (at least) two different averages at play here:

+ the unweighted average, i.e., just the average of all the students grades (no matter how many credits each course gives), and

+ the [weighted average](https://en.wikipedia.org/wiki/Weighted_arithmetic_mean), where we use the credits for a course as a weight.

First the unweighted average:

In [20]:
%%sql
select   avg(grade) as "Average"
from     peter

Running query in 'sqlite:///lab1.sqlite'

    Average
0  4.028571

And then the weighted average (feel free to ask me about this during QA sessions, if you get stuck):

In [21]:
%%sql
select   sum(grade*credits) / sum(credits) as "Weighted average"
from     peter

Running query in 'sqlite:///lab1.sqlite'

   Weighted average
0          4.138277

Hint: If you've created a proper view above, we'll get a 'table' with one row for each course the student has passed, and each row will contain information about grades and credits for the passed course.
If we use arithmetic operations in a select statement, and then use an aggregate function around that operation, we'll apply the aggregate function to each value the operation returns (so, e.g., a `sum` over a product will be a scalar product).

Now drop the view:

In [22]:
%%sql
drop view if exists peter;

Running query in 'sqlite:///lab1.sqlite'

Empty DataFrame
Columns: []
Index: []

<a id='review_problems'></a>

## Review problems

<a id='problem_6'></a>

### Problem 6 -- REVIEW

How many courses are there for each level (`G1`, `G2`, and `A`)?

In [23]:
%%sql
select    level, count() as count
from      courses
group by  level

Running query in 'sqlite:///lab1.sqlite'

  level  count
0     A     87
1    G1     31
2    G2     60

For each level, how many courses give more than 7.5 HP -- list only those categories with more than 5 such courses?

In [24]:
%%sql
select level, count() as count
from courses
where credits > 7.5
group by level
having count() > 5

Running query in 'sqlite:///lab1.sqlite'

  level  count
0    G1      6
1    G2      7

<a id='problem_7'></a>

### Problem 7 - REVIEW

For the five departments which offers the most total credits (for its courses in this database) -- output the name of the department, and the total number of offered credits:

In [25]:
%%sql
select     department_name, sum(credits)
from       departments 
           join courses using(department_code)
group by   department_name
order by   sum(credits) desc
limit      5

Running query in 'sqlite:///lab1.sqlite'

                   department_name  sum(credits)
0  Elektro- och informationsteknik         332.0
1                    Datavetenskap         216.0
2                        Matematik         160.0
3      Språk och litteraturcentrum         106.5
4             Matematisk statistik          84.0

<a id='problem_8'></a>

### Problem 8 - REVIEW

Which students (`ssn` and full name) have taken 0 credits? This problem can be solved in several ways, first do it with an outer join:

In [26]:
%%sql
select      ssn, first_name, last_name
from        students
            left outer join finished_courses using(ssn)
where       grade is NULL
order by    ssn

Running query in 'sqlite:///lab1.sqlite'

            ssn first_name   last_name
0   850517-2597      Filip     Persson
1   870909-3367   Caroline      Olsson
2   880206-1915     Joakim        Hall
3   891007-3091      Johan        Lind
4   891220-1393       Erik   Andersson
5   900129-3374     Henrik  Gustavsson
6   900313-2257       Erik   Andersson
7   911015-3758   Jonathan     Jönsson
8   931225-3158         Bo          Ek
9   950125-1153     Magnus    Hultgren
10  950829-1848       Anna     Nyström

Now do the same thing using a subquery:

In [27]:
%%sql
with zero_credits(ssn) as (
    select  ssn
    from    students
    
    except
    
    select  ssn
    from    finished_courses
)
select    ssn, first_name, last_name
from      students
where     ssn in zero_credits

Running query in 'sqlite:///lab1.sqlite'

            ssn first_name   last_name
0   850517-2597      Filip     Persson
1   870909-3367   Caroline      Olsson
2   880206-1915     Joakim        Hall
3   891007-3091      Johan        Lind
4   891220-1393       Erik   Andersson
5   900129-3374     Henrik  Gustavsson
6   900313-2257       Erik   Andersson
7   911015-3758   Jonathan     Jönsson
8   931225-3158         Bo          Ek
9   950125-1153     Magnus    Hultgren
10  950829-1848       Anna     Nyström

<a id='problem_9'></a>

### Problem 9 - REVIEW

List the names and average grades of the 10 students with the highest grade average? You can use the unweighted average.

In [28]:
%%sql
select   first_name, last_name, avg(grade)
from     students
         join finished_courses using(ssn)
group by ssn
order by avg(grade) desc
limit    10

Running query in 'sqlite:///lab1.sqlite'

  first_name   last_name  avg(grade)
0         Bo          Ek    4.350000
1     Helena     Troberg    4.307692
2     Elaine   Robertson    4.235294
3       Anna   Johansson    4.230769
4       Ylva   Jacobsson    4.218750
5       Anna   Johansson    4.200000
6     Mikael     Nilsson    4.173913
7      Jakob    Malmberg    4.166667
8      Maria   Andersson    4.157895
9   Per-Erik  Pettersson    4.153846

<a id='problem_10'></a>

### Problem 10 - REVIEW

List the social security number and total number of credits for all students -- order by total credits, descending. Students with no credits should be included in the listing, with 0 credits (not `NULL`).

Use an outer `JOIN` to solve the problem -- you might want to use the function `coalesce(v1, v2, ...)`; it returns the first value which is not `NULL`, so `coalesce(avg(grade), 0)` would give 0 if the were no grades (i.e., if `grade` were `NULL`), you can also try the `ifnull` function.

In [29]:
%%sql
select   ssn, coalesce(sum(credits), 0) as credits
from     students
         left outer join finished_courses using(ssn)
         left outer join courses using(course_code)
group by ssn
order by sum(credits) desc

Running query in 'sqlite:///lab1.sqlite'

            ssn  credits
0   951004-2346    350.0
1   880620-2564    348.5
2   910915-2068    338.0
3   920623-3258    334.0
4   921222-2113    332.0
..          ...      ...
67  900313-2257      0.0
68  911015-3758      0.0
69  931225-3158      0.0
70  950125-1153      0.0
71  950829-1848      0.0

[72 rows x 2 columns]

<a id='problem_11'></a>

### Problem 11 - REVIEW

Do all students have unique names (first name _and_ last name)? If not, show the full name and social security number for all students who have a namesake.

As usual there are several ways of solving this, solve it using a `WITH`-statement where you create a 'table' with all duplicate names, and then:

Use a `JOIN`:

In [30]:
%%sql
with name_duplicates(first_name, last_name) as (
    select   first_name, last_name
    from     students
    group by first_name, last_name
    having   count() > 1
)
select   ssn, first_name, last_name
from     name_duplicates
         join students using(first_name, last_name)

Running query in 'sqlite:///lab1.sqlite'

           ssn first_name  last_name
0  950705-2308       Anna  Johansson
1  930702-3582       Anna  Johansson
2  861103-2438         Bo         Ek
3  931225-3158         Bo         Ek
4  850819-2139         Bo         Ek
5  891220-1393       Erik  Andersson
6  900313-2257       Erik  Andersson

Use a subquery:

In [31]:
%%sql
with name_duplicates(first_name, last_name) as (
    select   first_name, last_name
    from     students
    group by first_name, last_name
    having   count() > 1
)
select   ssn, first_name, last_name
from     students
where    (first_name, last_name) in name_duplicates

Running query in 'sqlite:///lab1.sqlite'

           ssn first_name  last_name
0  950705-2308       Anna  Johansson
1  930702-3582       Anna  Johansson
2  861103-2438         Bo         Ek
3  931225-3158         Bo         Ek
4  850819-2139         Bo         Ek
5  891220-1393       Erik  Andersson
6  900313-2257       Erik  Andersson